tutorials/lagrangian/reactingParcelFoam/evaporationTest/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType      hsPsiMixtureThermo<reactingMixture<gasThermoPhysics>>;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/chemkin/foam.inp";

foamChemistryThermoFile "$FOAM_CASE/chemkin/foam.dat";

liquidComponents
(
    H2O
);

solidComponents
();

inertSpecie     N2;

H2O             H2O defaultCoeffs;


// ************************************************************************* //
